#include <stdio.h>

// 用联合体变量判断ARM或x86环境下，存储系统是是大端还是小端模式
//在小端模式中，低位字节放在低地址，高位字节放在高地址；在大端模式中，低位字节放在高地址，高位字节放在低地址。
int main()
{
    union w {
        int a;
        char b;
    } c;

    c.a = 1;
    if (c.b == 1)
    {
        //printf("little endian\n");
    }
    else
    {
        //printf("big endian\n");
    }

    int x = 1; // 0x00000001
    if (*(char *)&x)
    {
        printf("little endian\n");
        /* little endian. memory image 01 00 00 00 */
    }
    else
    {
        printf("big endian\n");
        /* big endian. memory image 00 00 00 01 */
    }

    return 0;
}

/*
说明：
1  在c中，联合体（共用体）的数据成员都是从低地址开始存放。
2  若是小端模式，由低地址到高地址c.a存放为0x01 00 00 00，c.b被赋值为0x01；

  ————————————————————————————

   地址 0x00000000 0x00000001 0x00000002 0x00000003

   c.a  01         00         00         00

   c.b  01         00        

  ————————————————————————————  
3  若是大端模式，由低地址到高地址c.a存放为0x00 00 00 01，c.b被赋值为0x0；

  ————————————————————————————

   地址 0x00000000 0x00000001 0x00000002 0x00000003

   c.a  00         00         00         01

   c.b  00         00                 

  ————————————————————————————  


4  根据c.b的值的情况就可以判断cpu的模式了，现在XP环境下的intel CPU是小端模式，不信你可测试下！

*/